In [1]:
import pandas as pd

In [4]:
9%2

1

In [6]:
## To create a list in Python containing a sequence of 0s and 1s using list comprehensions.

# Define the length of the list
length = 10  # Change this value to adjust the length of the list

# Create the list using list comprehension
binary_list = [0 if i % 2 == 0 else 1 for i in range(length)]

# Print the list
print(binary_list)
count = len(binary_list)
print(count)

[0, 1, 0, 1, 0, 1, 0, 1, 0, 1]
10

In [7]:
binary_list[1]

1

In [3]:
x = {
    'x':[0,1,0,1,0]
}
print(x)

{'x': [0, 1, 0, 1, 0]}

In [4]:
length = 15  # Change this value to adjust the length of the list

# Create the list using list comprehension
binary_list = [0 if i % 2 == 0 else 1 for i in range(length)]

# Print the list
print(binary_list)
count = len(binary_list)
print(count)

[0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0]
15

In [5]:
# creating a dataframe in pandas
# first create a dictionary
people = {                               # here the first, last and email are called keys while others are called values
    "first" : ["Corey", 'Jane', 'John'],
     "last" : ["Schafer", 'Doe', 'Doe'],
     "email" : ["CoreySchafer@gmail.com", 'JaneDoe@gmail.com', 'JohnDoe@gmail.com']
}

# convert the dictionary to a dataframe 

dfp = pd.DataFrame(people)

In [6]:
# to view the dictionary
people

{'first': ['Corey', 'Jane', 'John'],
 'last': ['Schafer', 'Doe', 'Doe'],
 'email': ['CoreySchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com']}

In [7]:
people['email']

['CoreySchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com']

In [8]:
dfp['email'] # this is more preferable in cases where your column name is same as a keyword in dataframe
# or 
dfp.email  # still gives same

0    CoreySchafer@gmail.com
1         JaneDoe@gmail.com
2         JohnDoe@gmail.com
Name: email, dtype: object

In [9]:
type(people['email'])

list

In [10]:
type(dfp['email'])

# you can think of a series as rows of a single column

pandas.core.series.Series

In [11]:
dfp[['last', 'email']]

      last                   email
0  Schafer  CoreySchafer@gmail.com
1      Doe       JaneDoe@gmail.com
2      Doe       JohnDoe@gmail.com

In [12]:
dfp.columns # to view all the column names

Index(['first', 'last', 'email'], dtype='object')

In [13]:
# iloc - to access rows and columns by integer location hence the name iloc - integer location.
dfp.iloc[0] # to acces the first row using the index which is 0

first                     Corey
last                    Schafer
email    CoreySchafer@gmail.com
Name: 0, dtype: object

In [14]:
# to access rows and columns - you state the rows index first then specift the column index
dfp.iloc[[1,2], 1]

1    Doe
2    Doe
Name: last, dtype: object

In [15]:
# loc - you search by label
dfp.loc[[0,1]]

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com

In [16]:
dfp.loc[[0,1], 'email']

0    CoreySchafer@gmail.com
1         JaneDoe@gmail.com
Name: email, dtype: object

In [17]:
dfp.loc[[0,1], ['email', 'last']]

                    email     last
0  CoreySchafer@gmail.com  Schafer
1       JaneDoe@gmail.com      Doe

In [18]:
# to set a column (in this case 'email') from our dataset as the index against the default index 
# (0, 1, 2 etc which always come at the leftmost side of a dataframe. Index is necessaary for setting a unique identifer for each row.
dfp.set_index('email') # this doesn't affect the original dataset as seen below

                        first     last
email
CoreySchafer@gmail.com  Corey  Schafer
JaneDoe@gmail.com        Jane      Doe
JohnDoe@gmail.com        John      Doe

In [19]:
dfp

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [20]:
# to make this change to have an effect on the dataset you add inplace=True
dfp.set_index('email', inplace=True)

In [21]:
dfp

                        first     last
email
CoreySchafer@gmail.com  Corey  Schafer
JaneDoe@gmail.com        Jane      Doe
JohnDoe@gmail.com        John      Doe

In [22]:
dfp.index

Index(['CoreySchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com'], dtype='object', name='email')

In [23]:
dfp.loc['CoreySchafer@gmail.com']

first      Corey
last     Schafer
Name: CoreySchafer@gmail.com, dtype: object

In [24]:
dfp.loc['CoreySchafer@gmail.com', 'last']

'Schafer'

In [25]:
# dfp.loc[0] # this work anymore bc we have labeled our index

In [26]:
dfp.iloc[0] # this still works bc by default the integer still exists but no longer on display

first      Corey
last     Schafer
Name: CoreySchafer@gmail.com, dtype: object

In [27]:
# to reset an index
dfp.reset_index(inplace=True)

In [28]:
dfp

                    email  first     last
0  CoreySchafer@gmail.com  Corey  Schafer
1       JaneDoe@gmail.com   Jane      Doe
2       JohnDoe@gmail.com   John      Doe

In [29]:
# filtering - to filter out lastname Doe
filt = dfp['last']=='Doe'

In [30]:
filt

0    False
1     True
2     True
Name: last, dtype: bool

In [31]:
dfp[filt]

               email first last
1  JaneDoe@gmail.com  Jane  Doe
2  JohnDoe@gmail.com  John  Doe

In [32]:
# or
dfp.loc[filt] # this makes it easier to filter by just a particular column eg

dfp.loc[filt,'first']

1    Jane
2    John
Name: first, dtype: object

In [33]:
# alternative to that, you can combine the two and run it once
dfp[dfp['last']=='Doe']

               email first last
1  JaneDoe@gmail.com  Jane  Doe
2  JohnDoe@gmail.com  John  Doe

In [34]:
# to filter for more than one using &
filt = (dfp['last']=='Doe') & (dfp['first']=='John')

In [35]:
dfp[filt]

               email first last
2  JohnDoe@gmail.com  John  Doe

In [36]:
# using or |
filt = (dfp['last']=='Schafer') | (dfp['first']=='John')

In [37]:
dfp[filt]

                    email  first     last
0  CoreySchafer@gmail.com  Corey  Schafer
2       JohnDoe@gmail.com   John      Doe

In [38]:
# the use of - to filter out values
dfp[-filt]

               email first last
1  JaneDoe@gmail.com  Jane  Doe

In [39]:
#  Updating Rows and Columns - Modifying Data Within DataFrames
# to change column names
dfp.columns = ['email','First Name', 'Last Name']

In [40]:
dfp.columns

Index(['email', 'First Name', 'Last Name'], dtype='object')

In [41]:
# to capitalize the column names
dfp.columns = [x.upper() for x in dfp.columns]

In [42]:
dfp

                    EMAIL FIRST NAME LAST NAME
0  CoreySchafer@gmail.com      Corey   Schafer
1       JaneDoe@gmail.com       Jane       Doe
2       JohnDoe@gmail.com       John       Doe

In [43]:
# so i intentionally added spacing inbetween the names which is exactky wrong, to replace this space with underscore
dfp.columns = dfp.columns.str.replace(' ', '_')

In [44]:
dfp

                    EMAIL FIRST_NAME LAST_NAME
0  CoreySchafer@gmail.com      Corey   Schafer
1       JaneDoe@gmail.com       Jane       Doe
2       JohnDoe@gmail.com       John       Doe

In [45]:
#to change the column names back to lowercase
dfp.columns = [x.lower() for x in dfp.columns]
dfp

                    email first_name last_name
0  CoreySchafer@gmail.com      Corey   Schafer
1       JaneDoe@gmail.com       Jane       Doe
2       JohnDoe@gmail.com       John       Doe

In [55]:
# to rearrange my columns 
new_order = ['first_name', 'last_name', 'email']
dfp = dfp[new_order]

In [58]:
dfp

  first_name last_name                   email
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@gmail.com
2       John     Smith     Johnsmith@gmail.com

In [59]:
# dfpto update rows
dfp.loc[2] = ['John', 'Smith', 'Johnsmith@gmail.com']

In [60]:
dfp

  first_name last_name                   email
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@gmail.com
2       John     Smith     Johnsmith@gmail.com

In [61]:
dfp.loc[2,['last_name', 'email']] = ['Doe', 'JohnDoe@gmail.com']

In [62]:
dfp

  first_name last_name                   email
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@gmail.com
2       John       Doe       JohnDoe@gmail.com

In [63]:
# to change just a value in a row
dfp.loc[2,'last_name'] = 'smith'

In [64]:
dfp

  first_name last_name                   email
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@gmail.com
2       John     smith       JohnDoe@gmail.com

In [65]:
# to change that back, you can still use the .loc or .at
dfp.at[2, 'last_name'] = 'Doe'

In [66]:
dfp

  first_name last_name                   email
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@gmail.com
2       John       Doe       JohnDoe@gmail.com

In [67]:
# to update multiple rows
dfp['email'] = dfp['email'].str.lower() # this changes all the email address to lower case

In [68]:
dfp

  first_name last_name                   email
0      Corey   Schafer  coreyschafer@gmail.com
1       Jane       Doe       janedoe@gmail.com
2       John       Doe       johndoe@gmail.com

In [ ]:
# 4 major methods for updating multiple rows:
# apply, map, applymap, replace

In [71]:
# Apply - use in callimg functions on our values, works for both series and dataframe
dfp['email'].apply(len) #returns the number of characters in the column email

0    22
1    17
2    17
Name: email, dtype: int64

In [73]:
dfp.apply(len) # shows the number of rows

first_name    3
last_name     3
email         3
dtype: int64

In [75]:
dfp.apply(len, axis ='columns')

0    3
1    3
2    3
dtype: int64

In [79]:
#applymap - works for the entire dataframe
dfp.applymap(len)

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_12456\4192801787.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  dfp.applymap(len)

   first_name  last_name  email
0           5          7     22
1           4          3     17
2           4          3     17

In [81]:
dfp.applymap(str.lower)

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_12456\3352421018.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  dfp.applymap(str.lower)

  first_name last_name                   email
0      corey   schafer  coreyschafer@gmail.com
1       jane       doe       janedoe@gmail.com
2       john       doe       johndoe@gmail.com

In [84]:
# replace
dfp['first_name'].replace({'Corey': 'Chris', 'Jane': 'Mary'})
# to implement that into the dataframe then we add  dfp['first_name'] = before the code

0    Chris
1     Mary
2     John
Name: first_name, dtype: object

In [10]:
import pandas as pd

In [14]:
d = pd.read_csv(r"C:\Users\ADMIN\Desktop\Sage's PowerBI BootCamp\Customers.csv")

In [15]:
d.head()

,CustomerKey,Prefix,FirstName,LastName,Unnamed: 4,Unnamed: 5,Unnamed: 6,BirthDate,Unnamed: 8,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner,Unnamed: 17,Unnamed: 18,BirthDate.1
0,11000,MR.,JON,YANG,MR. JON YANG,YANG,YANG,4/8/1966,NaN,M,M,jon24@learnsector.com,"$90,000",2,Bachelors,Professional,Y,NaN,NaN,14-05-1965
1,11001,MR.,EUGENE,HUANG,MR. EUGENE HUANG,HUANG,HUANG,14/05/1965,NaN,S,M,eugene10@learnsector.com,"$60,000",3,Bachelors,Professional,N,NaN,NaN,15-02-1968
2,11002,MR.,RUBEN,TORRES,MR. RUBEN TORRES,TORRES,TORRES,8/12/1965,NaN,M,M,ruben35@learnsector.com,"$60,000",3,Bachelors,Professional,Y,NaN,NaN,NaN
3,11003,MS.,CHRISTY,ZHU,MS. CHRISTY ZHU,ZHU,ZHU,15/02/1968,NaN,S,F,christy12@learnsector.com,"$70,000",0,Bachelors,Professional,N,NaN,NaN,NaN
4,11004,MRS.,ELIZABETH,JOHNSON,MRS. ELIZABETH JOHNSON,JOHNSON,JOHNSON,8/8/1968,NaN,S,F,elizabeth5@learnsector.com,"$80,000",5,Bachelors,Professional,Y,NaN,NaN,NaN

In [16]:
d.columns

Index(['CustomerKey', 'Prefix', 'FirstName', 'LastName', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'BirthDate', 'Unnamed: 8', 'MaritalStatus',
       'Gender', 'EmailAddress', 'AnnualIncome', 'TotalChildren',
       'EducationLevel', 'Occupation', 'HomeOwner', 'Unnamed: 17',
       'Unnamed: 18', 'BirthDate.1'],
      dtype='object')

In [20]:
remove = ['Unnamed: 18','Unnamed: 8','Unnamed: 4','Unnamed: 5', 'Unnamed: 6','Unnamed: 17','BirthDate.1']

In [21]:
d.drop(remove, axis = 1, inplace = True)

In [23]:
d.head()

,CustomerKey,Prefix,FirstName,LastName,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner
0,11000,MR.,JON,YANG,4/8/1966,M,M,jon24@learnsector.com,"$90,000",2,Bachelors,Professional,Y
1,11001,MR.,EUGENE,HUANG,14/05/1965,S,M,eugene10@learnsector.com,"$60,000",3,Bachelors,Professional,N
2,11002,MR.,RUBEN,TORRES,8/12/1965,M,M,ruben35@learnsector.com,"$60,000",3,Bachelors,Professional,Y
3,11003,MS.,CHRISTY,ZHU,15/02/1968,S,F,christy12@learnsector.com,"$70,000",0,Bachelors,Professional,N
4,11004,MRS.,ELIZABETH,JOHNSON,8/8/1968,S,F,elizabeth5@learnsector.com,"$80,000",5,Bachelors,Professional,Y

In [32]:
d["Full Name"] = d.Prefix + " " + d.FirstName + " " + d.LastName

In [33]:
d.head()

,CustomerKey,Prefix,FirstName,LastName,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner,Full Name
0,11000,MR.,JON,YANG,4/8/1966,M,M,jon24@learnsector.com,"$90,000",2,Bachelors,Professional,Y,MR. JON YANG
1,11001,MR.,EUGENE,HUANG,14/05/1965,S,M,eugene10@learnsector.com,"$60,000",3,Bachelors,Professional,N,MR. EUGENE HUANG
2,11002,MR.,RUBEN,TORRES,8/12/1965,M,M,ruben35@learnsector.com,"$60,000",3,Bachelors,Professional,Y,MR. RUBEN TORRES
3,11003,MS.,CHRISTY,ZHU,15/02/1968,S,F,christy12@learnsector.com,"$70,000",0,Bachelors,Professional,N,MS. CHRISTY ZHU
4,11004,MRS.,ELIZABETH,JOHNSON,8/8/1968,S,F,elizabeth5@learnsector.com,"$80,000",5,Bachelors,Professional,Y,MRS. ELIZABETH JOHNSON

In [35]:
d.drop(['Prefix',	'FirstName',	'LastName'], axis =	1, inplace = True)

In [36]:
d.head()

,CustomerKey,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner,Full Name
0,11000,4/8/1966,M,M,jon24@learnsector.com,"$90,000",2,Bachelors,Professional,Y,MR. JON YANG
1,11001,14/05/1965,S,M,eugene10@learnsector.com,"$60,000",3,Bachelors,Professional,N,MR. EUGENE HUANG
2,11002,8/12/1965,M,M,ruben35@learnsector.com,"$60,000",3,Bachelors,Professional,Y,MR. RUBEN TORRES
3,11003,15/02/1968,S,F,christy12@learnsector.com,"$70,000",0,Bachelors,Professional,N,MS. CHRISTY ZHU
4,11004,8/8/1968,S,F,elizabeth5@learnsector.com,"$80,000",5,Bachelors,Professional,Y,MRS. ELIZABETH JOHNSON

In [37]:
d["Full Name"] = d["Full Name"].values

In [38]:
d.head()

,CustomerKey,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner,Full Name
0,11000,4/8/1966,M,M,jon24@learnsector.com,"$90,000",2,Bachelors,Professional,Y,MR. JON YANG
1,11001,14/05/1965,S,M,eugene10@learnsector.com,"$60,000",3,Bachelors,Professional,N,MR. EUGENE HUANG
2,11002,8/12/1965,M,M,ruben35@learnsector.com,"$60,000",3,Bachelors,Professional,Y,MR. RUBEN TORRES
3,11003,15/02/1968,S,F,christy12@learnsector.com,"$70,000",0,Bachelors,Professional,N,MS. CHRISTY ZHU
4,11004,8/8/1968,S,F,elizabeth5@learnsector.com,"$80,000",5,Bachelors,Professional,Y,MRS. ELIZABETH JOHNSON

In [41]:
new = d.loc[:, ['CustomerKey','Full Name', 'BirthDate', 'MaritalStatus', 'Gender', 'EmailAddress',
       'AnnualIncome', 'TotalChildren', 'EducationLevel', 'Occupation',
       'HomeOwner']]

In [42]:
new

,CustomerKey,Full Name,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner
0,11000,MR. JON YANG,4/8/1966,M,M,jon24@learnsector.com,"$90,000",2,Bachelors,Professional,Y
1,11001,MR. EUGENE HUANG,14/05/1965,S,M,eugene10@learnsector.com,"$60,000",3,Bachelors,Professional,N
2,11002,MR. RUBEN TORRES,8/12/1965,M,M,ruben35@learnsector.com,"$60,000",3,Bachelors,Professional,Y
3,11003,MS. CHRISTY ZHU,15/02/1968,S,F,christy12@learnsector.com,"$70,000",0,Bachelors,Professional,N
4,11004,MRS. ELIZABETH JOHNSON,8/8/1968,S,F,elizabeth5@learnsector.com,"$80,000",5,Bachelors,Professional,Y
...,...,...,...,...,...,...,...,...,...,...,...
18143,29479,MR. TOMMY TANG,7/4/1958,M,M,tommy2@learnsector.com,"$30,000",1,Graduate Degree,Clerical,Y
18144,29480,MRS. NINA RAJI,11/10/1960,S,F,nina21@learnsector.com,"$30,000",3,Graduate Degree,Clerical,Y
18145,29481,MR. IVAN SURI,1/5/1960,S,M,ivan0@learnsector.com,"$30,000",3,Graduate Degree,Clerical,N
18146,29482,MR. CLAYTON ZHANG,3/5/1959,M,M,clayton0@learnsector.com,"$30,000",3,Bachelors,Clerical,Y
18147,29483,MR. JÉSUS NAVARRO,12/8/1959,M,M,jésus9@learnsector.com,"$30,000",0,Bachelors,Clerical,Y

In [43]:
new = d

In [44]:
d.dtypes

CustomerKey        int64
BirthDate         object
MaritalStatus     object
Gender            object
EmailAddress      object
AnnualIncome      object
TotalChildren      int64
EducationLevel    object
Occupation        object
HomeOwner         object
Full Name         object
dtype: object

In [49]:
d.AnnualIncome = d.AnnualIncome.str.strip().str.replace("$", "").str.replace(",","").astype('int')

In [50]:
d.dtypes

CustomerKey        int64
BirthDate         object
MaritalStatus     object
Gender            object
EmailAddress      object
AnnualIncome       int32
TotalChildren      int64
EducationLevel    object
Occupation        object
HomeOwner         object
Full Name         object
dtype: object

In [52]:
n = {"M" : "Married",
      "S" : "Single"}

In [55]:
d.MaritalStatus = d.MaritalStatus.map(n)

In [56]:
d.head()

,CustomerKey,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner,Full Name
0,11000,4/8/1966,Married,M,jon24@learnsector.com,90000,2,Bachelors,Professional,Y,MR. JON YANG
1,11001,14/05/1965,Single,M,eugene10@learnsector.com,60000,3,Bachelors,Professional,N,MR. EUGENE HUANG
2,11002,8/12/1965,Married,M,ruben35@learnsector.com,60000,3,Bachelors,Professional,Y,MR. RUBEN TORRES
3,11003,15/02/1968,Single,F,christy12@learnsector.com,70000,0,Bachelors,Professional,N,MS. CHRISTY ZHU
4,11004,8/8/1968,Single,F,elizabeth5@learnsector.com,80000,5,Bachelors,Professional,Y,MRS. ELIZABETH JOHNSON

In [59]:
d.Gender = d.Gender.replace({"M":"Male", "F" : "Female"})

In [60]:
d.head()

,CustomerKey,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner,Full Name
0,11000,4/8/1966,Married,Male,jon24@learnsector.com,90000,2,Bachelors,Professional,Y,MR. JON YANG
1,11001,14/05/1965,Single,Male,eugene10@learnsector.com,60000,3,Bachelors,Professional,N,MR. EUGENE HUANG
2,11002,8/12/1965,Married,Male,ruben35@learnsector.com,60000,3,Bachelors,Professional,Y,MR. RUBEN TORRES
3,11003,15/02/1968,Single,Female,christy12@learnsector.com,70000,0,Bachelors,Professional,N,MS. CHRISTY ZHU
4,11004,8/8/1968,Single,Female,elizabeth5@learnsector.com,80000,5,Bachelors,Professional,Y,MRS. ELIZABETH JOHNSON

In [65]:
d.groupby("Gender")["AnnualIncome"].mean().reset_index()

   Gender  AnnualIncome
0  Female  57344.804318
1    Male  57253.999562

In [66]:
d.groupby("Gender")["AnnualIncome"].mean()

Gender
Female    57344.804318
Male      57253.999562
Name: AnnualIncome, dtype: float64

In [72]:
round(d.Gender.value_counts( normalize= True)*100, 1)

Gender
Male      50.6
Female    49.4
Name: proportion, dtype: float64

In [78]:
d.groupby(["Gender", "MaritalStatus"]).size().reset_index().rename({0:"Count"}, axix=1)

TypeError: DataFrame.rename() got an unexpected keyword argument 'axix'

In [79]:
d

,CustomerKey,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner,Full Name
0,11000,4/8/1966,Married,Male,jon24@learnsector.com,90000,2,Bachelors,Professional,Y,MR. JON YANG
1,11001,14/05/1965,Single,Male,eugene10@learnsector.com,60000,3,Bachelors,Professional,N,MR. EUGENE HUANG
2,11002,8/12/1965,Married,Male,ruben35@learnsector.com,60000,3,Bachelors,Professional,Y,MR. RUBEN TORRES
3,11003,15/02/1968,Single,Female,christy12@learnsector.com,70000,0,Bachelors,Professional,N,MS. CHRISTY ZHU
4,11004,8/8/1968,Single,Female,elizabeth5@learnsector.com,80000,5,Bachelors,Professional,Y,MRS. ELIZABETH JOHNSON
...,...,...,...,...,...,...,...,...,...,...,...
18143,29479,7/4/1958,Married,Male,tommy2@learnsector.com,30000,1,Graduate Degree,Clerical,Y,MR. TOMMY TANG
18144,29480,11/10/1960,Single,Female,nina21@learnsector.com,30000,3,Graduate Degree,Clerical,Y,MRS. NINA RAJI
18145,29481,1/5/1960,Single,Male,ivan0@learnsector.com,30000,3,Graduate Degree,Clerical,N,MR. IVAN SURI
18146,29482,3/5/1959,Married,Male,clayton0@learnsector.com,30000,3,Bachelors,Clerical,Y,MR. CLAYTON ZHANG
18147,29483,12/8/1959,Married,Male,jésus9@learnsector.com,30000,0,Bachelors,Clerical,Y,MR. JÉSUS NAVARRO